app/Services/TransactionService.php

insert into `transactions` (`user_id`, `trx_type`, `amount`, `remarks`, `trx_id`, `charge`, `updated_at`, `created_at`) values (3, '-', 66, 'Place order96', '45PGZHM9PTTN', 0, '2023-06-26 14:28:45', '2023-06-26 14:28:45')
---
    public function createTransaction($user,$price,$remark,$type,$charge=0)
    {
        $transaction = new Transaction();
        $transaction->user_id = $user->id;
        $transaction->trx_type = '-';
        $transaction->amount = $price;
        $transaction->remarks = $remark;
        $transaction->trx_id = strRandom();
        $transaction->charge = $charge;
        $transaction->save();