app/Http/Traits/Notify.php

    public function mail($user, $templateKey = null, $params = [], $subject = null, $requestMessage = null)
    {
        $basic = Configure::first();
---
select * from `configures` limit 1

    public function adminPushNotification($templateKey, $params = [], $action = [] , $data = [] )
    {

        $basic = (object) config('basic');
        if ($basic->push_notification != 1) {
            return false;
        }

        $templateObj = NotifyTemplate::where('template_key', $templateKey)->where('status', 1)->first();

        if(!$templateObj){
            return false;
        }

        if ($templateObj) {
            $template = $templateObj->body;
            foreach ($params as $code => $value) {
                $template = str_replace('[[' . $code . ']]', $value, $template);
            }
            $action['text'] = $template;
        }

        $admins = Admin::all();
        foreach ($admins as $admin){
            $siteNotification = new SiteNotification();
            $siteNotification->description = $action;
            $admin->siteNotificational()->save($siteNotification);
---
select * from `notify_templates` where `template_key` = 'ORDER_CREATE' and `status` = 1 limit 1
select * from `admins`
insert into `site_notifications` (`description`, `site_notificational_id`, `site_notificational_type`, `updated_at`, `created_at`) values ('{\"link\":\"http:\/\/127.0.0.1:8000\/admin\/order\/edit\/96\",\"icon\":\"fas fa - cart - plus text - white\",\"text\":\"66  USD  order by \r\n\r\nmohammed_assi\r\n\r\n\"}', 1, 'App\Models\Admin', '2023-06-26 14:28:45', '2023-06-26 14:28:45')