app/Http/Controllers/User/OrderController.php

    public function create(Request $request)
    {
        $serviceId = @$request->serviceId;

        if (isset($serviceId)) {
            $data['selectService'] = Service::where('service_status', 1)->userRate()->with('category')->find($serviceId);
        } else {
            $data['selectService'] = null;
        }
        $data['categories'] = Category::with('service')
            ->whereHas('service', function ($query) {
                $query->where('service_status', 1)->userRate();
            })
            ->where('status', 1)
            ->get();
---
select * from `categories` where exists (select *, (select `price` from `user_service_rates` where `service_id` = `services`.`id` and `user_id` = 3) as `user_rate` from `services` where `categories`.`id` = `services`.`category_id` and `service_status` = 1) and `status` = 1
select * from `services` where `services`.`category_id` in (1, 2, 3, 4, 5, 7, 8)

    public function store(Request $request, User $apiUser = null)
    {
        $req = Purify::clean($request->all());
        $validate = $this->validateOrder($req);
        $service = Service::userRate()->findOrFail($request->service);
        $basic = (object)config('basic');
        $orderData = $this->setOrderData($request, $service);
        if ($service->min_amount <= $orderData['quantity'] && $service->max_amount >= $orderData['quantity']) {
            $quantity = $orderData['quantity'];
            $price = $orderData['price'];
            $user = $apiUser ? $apiUser : Auth::user();
            if ($user->balance < $price) {
                if ($apiUser)
                    return response()->json(['errors' => ['message' => "Insufficient balance."]], 422);
                else
                    return back()->with('error', "Insufficient balance in your wallet.")->withInput();
            }
            DB::beginTransaction();
            try {
                //create new ordrer without save
                $order = $this->createOrder($req, $orderData, $user);
                //proccessing provider order
                if (isset($service->api_provider_id) && $service->api_provider_id != 0) {
                    $this->apiProviderOrder($service, $req, $order);
                }
                $order->save();
---
insert into `orders` (`user_id`, `category_id`, `service_id`, `link`, `quantity`, `status`, `price`, `runs`, `interval`, `status_description`, `updated_at`, `created_at`) values (3, 8, '32', 'www.test.com', '2', 'processing', 66, '', '', 'error: {', '2023-06-26 14:28:45', '2023-06-26 14:28:45')

    public function apiProviderOrder($service, $req, $order)
    {
        $apiproviderdata = ApiProvider::find($service->api_provider_id);
---
select * from `api_providers` where `api_providers`.`id` = 2 limit 1