app/Http/Controllers/OrderController.php

    public function edit(Order $order, $id)
    {
        $order = Order::with('users')->find($id);
        $categories = Category::with('service')->has('service')->get();
---
select * from `orders` where `orders`.`id` = '97' limit 1
select * from `users` where `users`.`id` in (3)
select * from `categories` where exists (select * from `services` where `categories`.`id` = `services`.`category_id`)
select * from `services` where `services`.`category_id` in (1, 2, 3, 4, 5, 7, 8)